JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rwnx_tx.c
/* NuttX port: the prologue below came from a wrapper translation unit
 * at wifi/hal_port/vendor_sources/rwnx_tx.c, which existed only to include this
 * file.  The build lists this file directly now.
 */
/* Wi-Fi-only translation unit: establish Armino's global build contract. */
#include <bk_prelude.h>
#include "driver.h"

#include <common/bk_include.h>
#include "fhost_tx.h"
#include "rw_msdu.h"
#include "bk_rw.h"
//#include <os/str.h>
//#include <os/mem.h>
#include "rwnx_defs.h"
#if CONFIG_WIFI_VNET_CONTROLLER
#include "controller_wifi_if.h"
#endif

#if (CONFIG_FULLY_HOSTED || CONFIG_SEMI_HOSTED)
#include "pbuf.h"
#if CONFIG_SEMI_HOSTED
#include "sk_intf.h"
#endif
#endif
#include "rwnx_rx.h"
#include "ieee802_11_defs.h"
#include "wpa_ctrl.h"
#include "main_none.h"
#include "bk_wifi_private.h"
#include "ctrl_iface.h"
#include "rwnx_tx.h"
#include "rwnx_misc.h"
#if 1//CONFIG_RWNX_PROTO_DEBUG
#include "rwm_proto.h"
#endif
#if CONFIG_RWNX_TD
#include "rwnx_td.h"
#endif
#include "bk_general_dma.h"
#include "prot/ieee.h"
#include "lwip/def.h"
#include "bk7258_m2_snapshot.h"

#define dbg(...)

/*
 * Correlate an EAPOL descriptor's submit and terminal confirmation without
 * changing the descriptor ABI consumed by libwifi.a.  The opaque MAC owns
 * status writeback; this probe only snapshots registered MAC IRQ counters.
 */
#define RWNX_EAPOL_CFM_PROBE_SLOTS 4

struct rwnx_eapol_cfm_probe_s
{
	struct txdesc *txdesc;
	uint32_t isr31;
	uint32_t isr33;
	uint32_t isr34;
	uint32_t isr35;
	uint32_t isr36;
};

extern volatile uint32_t bk7258_wifi_isr_count[64];

static struct rwnx_eapol_cfm_probe_s
	g_rwnx_eapol_cfm_probe[RWNX_EAPOL_CFM_PROBE_SLOTS];

static void rwnx_eapol_cfm_probe_submit(struct txdesc *txdesc)
{
	uint32_t slot;
	uint32_t empty = RWNX_EAPOL_CFM_PROBE_SLOTS;
	GLOBAL_INT_DECLARATION();

	GLOBAL_INT_DISABLE();
	for (slot = 0; slot < RWNX_EAPOL_CFM_PROBE_SLOTS; slot++)
	{
		if (g_rwnx_eapol_cfm_probe[slot].txdesc == txdesc)
		{
			empty = slot;
			break;
		}

		if (g_rwnx_eapol_cfm_probe[slot].txdesc == NULL &&
			empty == RWNX_EAPOL_CFM_PROBE_SLOTS)
		{
			empty = slot;
		}
	}

	if (empty < RWNX_EAPOL_CFM_PROBE_SLOTS)
	{
		g_rwnx_eapol_cfm_probe[empty].txdesc = txdesc;
		g_rwnx_eapol_cfm_probe[empty].isr31 = bk7258_wifi_isr_count[31];
		g_rwnx_eapol_cfm_probe[empty].isr33 = bk7258_wifi_isr_count[33];
		g_rwnx_eapol_cfm_probe[empty].isr34 = bk7258_wifi_isr_count[34];
		g_rwnx_eapol_cfm_probe[empty].isr35 = bk7258_wifi_isr_count[35];
		g_rwnx_eapol_cfm_probe[empty].isr36 = bk7258_wifi_isr_count[36];
	}
	GLOBAL_INT_RESTORE();
}

static bool rwnx_eapol_cfm_probe_take(struct txdesc *txdesc,
		struct rwnx_eapol_cfm_probe_s *probe)
{
	uint32_t slot;
	bool found = false;
	GLOBAL_INT_DECLARATION();

	GLOBAL_INT_DISABLE();
	for (slot = 0; slot < RWNX_EAPOL_CFM_PROBE_SLOTS; slot++)
	{
		if (g_rwnx_eapol_cfm_probe[slot].txdesc == txdesc)
		{
			*probe = g_rwnx_eapol_cfm_probe[slot];
			g_rwnx_eapol_cfm_probe[slot].txdesc = NULL;
			found = true;
			break;
		}
	}
	GLOBAL_INT_RESTORE();

	return found;
}


/// Length of a char in bytes
#define CHAR_LEN    (CHAR_BIT/8)

/**
 ****************************************************************************************
 * @brief Converts a CPU pointer into a HW address
 * This macro is used to convert a SW pointer into the corresponding HW address. With CPUs
 * having native byte support, the value returned will be the same as the pointer passed.
 * With TL4, the value returned is the pointer multiplied by 2.
 * @param[in] ptr Pointer to be converted
 * @return The corresponding HW address
 ****************************************************************************************
 */
#define CPU2HW(ptr) (((uint32_t)(ptr)) * CHAR_LEN)
/// Array converting a TID to its associated AC
extern const uint8_t mac_tid2ac[];

/* Forward declaration */
struct ke_sk_params;
extern int ke_mgmt_packet_tx(const struct ke_sk_params *params);
#if CONFIG_WIFI_VNET_CONTROLLER
extern struct cif_env_t cif_env;
#endif
uint64_t rwnx_hw_mm_features();

#if !CONFIG_RWNX_SW_TXQ
static void rwnx_tx_confirm(void *param)
{
	struct txdesc *txdesc = (struct txdesc *)param;
	MSDU_NODE_T *node = txdesc->host.buf;

	if (txdesc && node) {
		struct fhost_tx_desc_tag *fhost_txdesc = container_of(txdesc, struct fhost_txdesc, txdesc);
		void (*cfm_cb)(void *) = txdesc->host.cfm_cb;

		os_null_printf("%s %d: txdesc %p, fhost_txdesc %p, cfm_cb %p, arg %p\n",
					   __func__, __LINE__, txdesc, fhost_txdesc, cfm_cb, txdesc->host.cfm_cb_arg);

		if (co_list_is_empty(&vif_mgmt_env.used_list)) {
			//do nothing
			RWNX_LOGD("rwnx_tx_confirm, vif empty\n");
		} else {
			// callback for mgmt frame tx
			if (cfm_cb)
				cfm_cb(txdesc->host.cfm_cb_arg);
		}
		RWNX_LOGV("flush_desc: node %p, pbuf %p\n", node, node->p);

		if (node->p) {
			pbuf_free(node->p);
			node->p = NULL;
		} else if (node->msdu_ptr) {
			//fix jira BK7256-4139
			os_free(node->msdu_ptr);
			node->msdu_ptr = NULL;
		}
		// free msdu
		os_free(node);
		txdesc->host.buf = NULL;

		// free fhost tx descriptor
		os_free(fhost_txdesc);
	}
}

#else // CONFIG_RWNX_SW_TXQ

#if CONFIG_MAC_SFRAME_SOFTWARE_RETRY
/**
 * check if the frame needs to be retransmitted if tx failed.
 */
static bool rwnx_need_retry_tx_frame(struct sk_buff *skb)
{
	struct txdesc *txdesc = &skb->ftxdesc->txdesc;

	switch (PP_NTOHS(txdesc->host.ethertype)) {
	case ETHTYPE_ARP:
		// Don't retry send special frame that doesn't open TD window
		if (txdesc->host.flags & TXU_CNTRL_IS_SPECIAL_FRAME)
			return false;
		return true;
	case ETHTYPE_EAPOL:
	case ETHTYPE_RARP:
		return true;
	case ETHTYPE_IP:
		// Check DHCP
		if (skb->sframe_type == S_FRAME_DHCP)
			return true;
		return false;
	default:
		return false;
	}
}
#endif

struct pbuf *macif_get_txdesc_pbuf(struct txdesc *txdesc)
{
    MSDU_NODE_T * node = (MSDU_NODE_T *)(txdesc->host.buf);
    return node ? node->p : NULL;
}
/**
 * @return true if mgmt frame is still within retry lifetime
 */
static bool rwnx_mgmt_retry_tx_check(struct sk_buff *skb)
{
	unsigned long jiffies_now;
	unsigned long skb_timeout = RWNX_MGMT_TXQ_MAX_QUEUE_JIFFIES;


