JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rwnx_tx.c
	jiffies_now = bk_get_tick();
	if (!time_after(jiffies_now, skb->jiffies + skb_timeout))
		return true;

	return false;
}
static void rwnx_tx_confirm(void *param)
{
	struct txdesc *txdesc = (struct txdesc *)param;
#if NX_VERSION >= NX_VERSION_PACK(6, 22, 0, 0)
	struct sk_buff *skb = txdesc->host.hostid;
#else
	struct sk_buff *skb = txdesc->host.buf;
#endif

	if (txdesc && skb) {
		struct fhost_tx_desc_tag *fhost_txdesc =
				container_of(txdesc, struct fhost_tx_desc_tag, txdesc);
		//struct tx_cfm_tag *cfm = txl_cfm_tag_get(txdesc);
		struct tx_cfm_tag *cfm = &txdesc->host.cfm;
		struct rwnx_txq *txq = skb->txq;
		void (*cb)(void *, bool) = skb->cb;

		bk_null_printf("%s %d: txdesc %p, fhost_txdesc %p, cb %p, arg %p\n",
					   __func__, __LINE__, txdesc, fhost_txdesc,
					   cb, skb->args);

		if (txq && cfm->credits) {
			txq->credits += cfm->credits;
			if (txq->credits <= 0)
				rwnx_txq_stop(txq, RWNX_TXQ_STOP_FULL);
			else if (txq->credits > 0)
				rwnx_txq_start(txq, RWNX_TXQ_STOP_FULL);
		}

#if 0// TODO ,CONFIG_MAC_SFRAME_SOFTWARE_RETRY
		RWNX_LOGV("%s: stype %d, jiffies %llu, current %llu\n", __func__,
			skb->sframe_type, skb->jiffies, bk_get_tick());

		// ACK not received, and not discard by txu, do software retry
		if (rwnx_need_retry_tx_frame(skb) &&
			!(cfm->status & TX_STATUS_ACKNOWLEDGED) &&
			!(cfm->status & TX_STATUS_DISCARDED)) {
			// Check software retry
			// 1. lifetime not exceeds 2s
			// 2. counter not exceeds 10 times
			if (time_before(bk_get_tick(), skb->jiffies + 2 * bk_get_ticks_per_second()) &&
				skb->sframe_sw_retry_cnt < 10) {
				skb->sframe_sw_retry_cnt++;

				RWNX_LOGD("%s: requeue skb\n", __func__);
				// Requeue skb
				if (rwnx_txq_queue_skb(skb, txq, 0, NULL))
					rwnx_hwq_process(txq->hwq);
				return;
			}
		}
#endif

		// callback for mgmt frame tx
		if (cb && skb->args)
			cb(skb->args, !!(cfm->status & TX_STATUS_ACKNOWLEDGED));

		bk_null_printf("flush_desc: node %p, pbuf %p\n", skb, skb->p);

		kfree_skb(skb);
	}
}

#define PRIO_STA_NULL 0xAA

static const int rwnx_down_hwq2tid[3] = {
    [RWNX_HWQ_BK] = 2,
    [RWNX_HWQ_BE] = 3,
    [RWNX_HWQ_VI] = 4,
};

static void rwnx_downgrade_ac(void *vif, struct sk_buff *skb)
{
    int8_t ac = rwnx_tid2hwq[skb->priority];
	uint8_t acm = mac_vif_mgmt_get_bss_info_edca_param_acm(vif);

    if (WARN((ac > RWNX_HWQ_VO),
             "Unexepcted ac %d for skb before downgrade", ac))
        ac = RWNX_HWQ_VO;

    while (acm & BIT(ac)) {
        if (ac == RWNX_HWQ_BK) {
            skb->priority = 1;
            return;
        }
        ac--;
        skb->priority = rwnx_down_hwq2tid[ac];
    }
}

void rwm_tx_msdu_renew(UINT8 *buf, UINT32 len, UINT8 *orig_addr)
{
#if CONFIG_GENERAL_DMA
	dma_memcpy((void *)((UINT32)orig_addr + CONFIG_MSDU_RESV_HEAD_LENGTH), buf, len);
#else
	os_memmove((void *)((UINT32)orig_addr + CONFIG_MSDU_RESV_HEAD_LENGTH), buf, len);
#endif
}

void rwm_tx_mpdu_renew(UINT8 *buf, UINT32 len, UINT8 *orig_addr)
{
#if CONFIG_GENERAL_DMA
	dma_memcpy((void *)((UINT32)orig_addr), buf, len);
#else
	os_memmove((void *)((UINT32)orig_addr), buf, len);
#endif
}

#if !CONFIG_FULLY_HOSTED
int rwm_raw_frame_with_cb(uint8_t *buffer, int len, void *cb, void *param)
{
	/* TODO: BK7236 monitor tx */
	return len;
}
#endif /* !CONFIG_FULLY_HOSTED */

/*
 * IEEE802.11-2016: Table 10-1—UP-to-AC mappings
 */
static uint8_t ipv4_ieee8023_dscp(void *buf)
{
	uint8_t tos;
	struct ipv4_hdr *hdr = (struct ipv4_hdr *)buf;

	tos = IPH_TOS(hdr);

	return (tos & 0xfc) >> 5;
}

/* extract flow control field */
static uint8_t ipv6_ieee8023_dscp(void *buf)
{
	uint8_t tos;
	struct ipv6_hdr *hdr = (struct ipv6_hdr *)buf;

	tos = IP6H_FL(hdr);

	return (tos & 0xfc) >> 5;
}

/*
 * get user priority from @buf.
 * ipv4 dscp/tos, ipv6 flow control. for eapol packets, disable qos.
 */
static uint8_t classify8021d(UINT8 *buf)
{
	struct ethhdr *ethhdr = (struct ethhdr *)buf;

	switch (PP_HTONS(ethhdr->proto)) {
#if CONFIG_WFA_CERT
	case ETHTYPE_IP:
		return ipv4_ieee8023_dscp(ethhdr + 1);
	case ETHTYPE_IPV6:
		return ipv6_ieee8023_dscp(ethhdr + 1);
#endif
	case ETH_P_PAE:
		return 7;	/* TID7 highest user priority */
	default:
		return 0;   /* TID0: mapped to AC_BE */
	}
}


/**
 * rwnx_set_more_data_flag - Update MORE_DATA flag in tx sw desc
 *
 * @rwnx_hw: Driver main data
 * @sw_txhdr: Header for pkt to be pushed
 *
 * If STA is in PS mode
 *  - Set EOSP in case the packet is the last of the UAPSD service period
 *  - Set MORE_DATA flag if more pkt are ready for this sta
 *  - Update TIM if this is the last pkt buffered for this sta
 *
 * note: tx_lock already taken.
 */
static void rwnx_set_more_data_flag(struct sk_buff *skb)
{
    void *sta = sta_mgmt_get_entry(skb->sta_idx);
    struct rwnx_txq *txq = skb->txq;
    struct rwnx_sta_ps *ps;
	struct txdesc *txdesc = &skb->ftxdesc->txdesc;

	ps = sta_mgmt_get_sta_ps(sta);

    if (unlikely(ps->active)) {
        ps->pkt_ready[txq->ps_id]--;
        // sta->ps.sp_cnt[txq->ps_id]--;

        // trace_ps_push(sta);

        if (((txq->ps_id == UAPSD_ID) /*|| (vif->wdev.iftype == NL80211_IFTYPE_MESH_POINT)*/)
                && !ps->sp_cnt[txq->ps_id]) {
            txdesc->host.flags |= TXU_CNTRL_EOSP;
        }

        if (ps->pkt_ready[txq->ps_id]) {
            txdesc->host.flags |= TXU_CNTRL_MORE_DATA;
        } else {
            rwnx_set_traffic_status(sta, false, txq->ps_id);
        }
    }
}

/**
 *  rwnx_tx_push - Push one packet to fw
 *
 * @rwnx_hw: Driver main data
 * @txhdr: tx desc of the buffer to push
 * @flags: push flags (see @rwnx_push_flags)
 *
 * Push one packet to fw. Sw desc of the packet has already been updated.
 * Only MORE_DATA flag will be set if needed.
 */
void rwnx_tx_push(struct sk_buff *skb)
{
	struct rwnx_txq *txq = skb->txq;
	struct txdesc *txdesc = &skb->ftxdesc->txdesc;
	int ret;

	if (txq->nb_retry) {
		txq->nb_retry--;
		if (txq->nb_retry == 0) {
			BK_ASSERT((struct sk_buff *)skb == txq->last_retry_skb);
			txq->last_retry_skb = NULL;
		}
	}

	// Set More Data Bit / EOSP bit
	if (skb->sta_idx != INVALID_STA_IDX)
		rwnx_set_more_data_flag(skb);

	// Push to UMAC
	ret = fhost_txbuf_push(txdesc, skb->ac);
	if (ret)
		goto tx_exit;

	// If successfully push to umac, decrease txq credits
	txq->credits--;
	if (txq->credits <= 0)
		rwnx_txq_stop(txq, RWNX_TXQ_STOP_FULL);

	return;
tx_exit:
	if (skb)
	{
		#if CONFIG_RWNX_TD
		rwnx_td_pkt_dec(skb->vif_idx,skb->ac);
		#endif
		kfree_skb(skb);
	}
}

