JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rwnx_tx.c
static struct rwnx_txq *rwnx_select_txq(struct sk_buff *skb)
{
	void *rwnx_vif;
	struct rwnx_txq *txq = NULL;
	ETH_HDR_PTR eth_hdr_ptr;
	UINT8 *content_ptr;
	void *sta = NULL;

	/* default to no sta, packet will be dropped */
	skb->priority = PRIO_STA_NULL;

	content_ptr = skb->p->payload;
	eth_hdr_ptr = (ETH_HDR_PTR)content_ptr;

	rwnx_vif = rwm_mgmt_vif_idx2ptr(skb->vif_idx);
	if (!rwnx_vif) {
		RWNX_LOGD("%s: vif is NULL!\r\n", __func__);
		return NULL;
	}

	if (likely(mac_vif_mgmt_get_active(rwnx_vif))) {
		uint8_t sta_idx = rwm_mgmt_tx_get_staidx(skb->vif_idx, eth_hdr_ptr->e_dest);
		if (sta_idx != INVALID_STA_IDX)
			sta = sta_mgmt_get_entry(sta_idx);
	}

	if (sta && (!sta_mgmt_get_valid(sta)))
	{
		RWNX_LOGD("%s: sta is invalid!\r\n", __func__);
		return NULL;
	}

	if (sta && (mac_sta_mgmt_get_capa_flags(sta) & STA_QOS_CAPA)) {
		skb->priority = classify8021d((uint8_t *)eth_hdr_ptr);
		rwnx_downgrade_ac(rwnx_vif, skb);

		txq = rwnx_txq_sta_get(sta, skb->priority);
		skb->ac = mac_tid2ac[skb->priority];
	} else if (sta) {
		// Non Qos: BC/MC
		txq = rwnx_txq_sta_get(sta, 0);
		skb->priority = 0xFF;
		skb->ac = AC_BE;
	}
	if (txq) {
		if (!txq->hwq) {
			RWNX_LOGD("%s: vif_idx %d, rwnx_vif %p, dst mac %pm, sta %p\n",
				__func__, skb->vif_idx, rwnx_vif, eth_hdr_ptr->e_dest, sta);
		}
		BK_ASSERT(txq->hwq);
	}
#if 1 /* bring-up probe, remove when the 4-way closes */
	/* The `goto exit` on !txq in rwnx_start_xmit() is the one silent drop on
	 * the EAPOL M2 path: the board reached 4WAY_HANDSHAKE (M1 received, PTK
	 * derived) but every "Sending EAPOL-Key 2/4" failed with result<0 and
	 * neither RWNX_LOGD line above fired, leaving two indistinguishable
	 * causes: vif inactive (skips the sta lookup with no log) or the closed
	 * lib's vif_mgmt_tx_get_staidx() missing the AP entry.  One rate-limited
	 * line here separates them: active=0 says the vif flag, sta_idx=INVALID
	 * (0xFF) says the lookup.  Editing this vendored file follows the
	 * rw_task.c dispatch-fix precedent; revert with the probe. */
	else {
		static uint32_t txqmiss_seq;

		if ((txqmiss_seq++ & 0x07) == 0)
			RWNX_LOGW("txq miss: vif=%u active=%d sta_idx=%u dst="MACSTR"\n",
					  skb->vif_idx,
					  mac_vif_mgmt_get_active(rwnx_vif),
					  skb->sta_idx,
					  MAC2STR(eth_hdr_ptr->e_dest));
	}
#endif
	return txq;
}

__ITCM_N uint32_t rwnx_tx_get_pbuf_chain_cnt(struct pbuf *p)
{
	struct pbuf *p_ptr = p;
	uint32_t p_cnt = 0;

	while (p_ptr != NULL)
	{
		p_cnt++;
		p_ptr = p_ptr->next;
	}

	return p_cnt;
}

/**
 *    Called when a packet needs to be transmitted.
 *  - Initialize the desciptor for this pkt (stored in skb before data)
 *  - Push the pkt in the corresponding Txq
 *  - If possible (i.e. credit available and not in PS) the pkt is pushed
 *    to fw
 */
#if CONFIG_RWNX_PROTO_DEBUG
extern uint8_t proto_debug_flag;
#endif

int fhost_txdesc_extra_size()
{
	return txdesc_extra_size() + 8;
}

static int rwnx_sg_init(struct sk_buff *skb, uint32_t seg_addr[], int seg_len[], int *seg_cnt)
{
	int i;
	struct pbuf *p = skb->p;
	int max_sg_size = macif_max_sg_size();

	for (i = 0; p && i < max_sg_size; i++) {
		if (i == 0) {
			/* pbd[0] trim ethernet hdr */
			seg_addr[i] = (uint32_t)p->payload + sizeof(ETH_HDR_T);
			seg_len[i] = p->len - sizeof(ETH_HDR_T);
		} else {
			seg_addr[i] = (uint32_t)p->payload;
			seg_len[i] = p->len;
		}
		p = p->next;
	}

	*seg_cnt = i;

	if (p && i == max_sg_size) {
		int remain = 0;

		while (p) {
			remain++;
			p = p->next;
		}

		RWNX_LOGE("not all data are pushed, remain pbuf %d, pbd %d\n", remain, i);

		return -1;
	}

	return 0;
}

__ITCM_N int rwnx_start_xmit(uint8_t vif_idx, struct pbuf *p, BUS_MSG_T *msg)
{
	struct fhost_tx_desc_tag *fhost_txdesc;
	struct hostdesc *host;
	struct txdesc *txdesc;
	ETH_HDR_PTR eth_hdr_ptr;
	struct rwnx_txq *txq;
	struct sk_buff *skb = NULL;
	int ret = 0;
	bool more_pbuf = !!(rwnx_hw_mm_features() & (1ULL << MM_FEAT_MORE_TBD_BIT));
	uint32_t p_cnt = 0;
	int max_sg_size = macif_max_sg_size();
	// TBD: dynamic alloc array in stack
    uint32_t seg_addr[max_sg_size];
    int seg_len[max_sg_size];
    int seg_cnt = max_sg_size;

#if CONFIG_WIFI_VNET_CONTROLLER
	bool is_ctrl_if_data = false;
	if(vif_idx >= 0xF)
	{
		TX_STAT_INC(data_tx_xmit);
		is_ctrl_if_data = true;
		vif_idx -= 0xF;
		p->flags |= PBUF_FLAG_IS_EXTERNAL;
	}
#endif

	//BK_LOGD(NULL,"%s: sizeof(fhost_tx_desc_tag)=%d, sizeof(txdesc)=%d, more_pbuf %d\n", __func__,
	//	sizeof(*fhost_txdesc), sizeof(*txdesc), more_pbuf);
#if CONFIG_WAPI_SUPPORT
	struct pbuf *q;
	err_t err;

	q = pbuf_alloc(PBUF_RAW_TX, p->tot_len, PBUF_RAM);

	if (q) {
		if ((err = pbuf_copy(q, p)) != ERR_OK) {
			RWNX_LOGV("copy p failed\r\n");
			pbuf_free(q);
			goto exit;
		}
		else
		{
			pbuf_free(p);
			p = q;
		}
	}
	else
	{
		RWNX_LOGV("alloc p failed\r\n");
		goto exit;
	}
#endif
	skb = (struct sk_buff *)((uint8_t *)p + (sizeof(struct pbuf)));

	if (!skb) {
		RWNX_LOGI("rwnx_start_xmit: invalid skb pointer\n");
		goto exit;
	}

	memset(skb, 0, sizeof(struct sk_buff));
	skb->p = p;
	skb->next = NULL;
	skb->prev = NULL;
	skb->msdu_ptr = p->payload;
	skb->len = p->tot_len;

	if (rwnx_sg_init(skb, seg_addr, seg_len, &seg_cnt)) {
		goto exit;
	}

	// Fill skb members
	skb->vif_idx = vif_idx;
	//skb->p = p;
	skb->cb = msg->cb;
	skb->args = msg->param;
	eth_hdr_ptr = (ETH_HDR_PTR)p->payload;
#if CONFIG_RWNX_PROTO_DEBUG
	if(proto_debug_flag) {
		rwm_proto_printf(0, (struct ethhdr *)eth_hdr_ptr);
	}
#endif
	skb->sta_idx = rwm_mgmt_tx_get_staidx(vif_idx, &eth_hdr_ptr->e_dest);

	// Select TXQ
	txq = rwnx_select_txq(skb);
	if (!txq || skb->priority == PRIO_STA_NULL) {
		goto exit;
	}
	// TXQ not initialized
	if (txq->idx == TXQ_INACTIVE || !txq->hwq) {
		RWNX_LOGE("%s %d: txq %p, idx %d, hwq %p\n", __func__, __LINE__, txq, txq->idx, txq->hwq);
		BK_ASSERT(0);
		goto exit;
	}
	skb->txq = txq;

	if (more_pbuf)
		p_cnt = rwnx_tx_get_pbuf_chain_cnt(p);

	// alloc tx desc
	fhost_txdesc = (struct fhost_tx_desc_tag *)((uint8_t *)skb + (sizeof(struct sk_buff)));
	if((sizeof(struct fhost_tx_desc_tag) + fhost_txdesc_extra_size() + p_cnt * sizeof(struct tx_pbd) + (sizeof(struct sk_buff))) > CONFIG_MSDU_RESV_DESC_LENGTH)
	{
		RWNX_LOGI("rwnx_start_xmit overflow mem \r\n");
		BK_ASSERT(0);
	}
	memset(fhost_txdesc, 0, sizeof(struct fhost_tx_desc_tag));

	if (!fhost_txdesc)
		goto exit;

