JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rwnx_tx.c
	// Fill skb members
	skb->ftxdesc = fhost_txdesc;

	// descriptor
	txdesc = &fhost_txdesc->txdesc;
	host = &txdesc->host;

	//fill host desc
#if NX_VERSION >= NX_VERSION_PACK(6, 22, 0, 0)
	host->hostid = skb;
#else
	host->buf = skb;
#endif
	os_memcpy(&host->eth_dest_addr, &eth_hdr_ptr->e_dest, ETH_ALEN);
	os_memcpy(&host->eth_src_addr, &eth_hdr_ptr->e_src, ETH_ALEN);
#if NX_AMSDU_TX || NX_VERSION >= NX_VERSION_PACK(6, 22, 0, 0)
	host->packet_addr[0]   = CPU2HW(p->payload + sizeof(ETH_HDR_T));
	host->packet_len[0]    = skb->len - sizeof(ETH_HDR_T);
#if NX_AMSDU_TX
	host->packet_cnt	   = 1;
#endif
#else
	host->packet_addr	   = CPU2HW(p->payload + sizeof(ETH_HDR_T));
	host->packet_len	   = skb->len - sizeof(ETH_HDR_T);
#endif
#if !NX_FULLY_HOSTED
	host.status_desc_addr  = (uint32_t)p->payload + sizeof(ETH_HDR_T);
#endif
	host->ethertype 	   = eth_hdr_ptr->e_proto;
	// if (rwnx_use_lowest_rate(eth_hdr_ptr))
	//	host->flags |= TXU_CNTRL_MGMT_LOWEST_RATE;
	host->tid = skb->priority;
	host->vif_idx = skb->vif_idx;
	host->staid = skb->sta_idx;

	// if frame that doesn't need to open TD window, set SPECIAL_FRAME flag
	if (msg->type == BMSG_SPECIAL_TX_TYPE)
		host->flags |= TXU_CNTRL_IS_SPECIAL_FRAME;

	if (fhost_txdesc_init(txdesc, seg_addr, seg_len, seg_cnt))
		goto exit;

	/* This copies scalar host fields and samples only whitelisted read-only
	 * registers. It does not modify the descriptor consumed by libwifi.a. */
	if (PP_HTONS(host->ethertype) == ETH_P_PAE)
	{
		bk7258_m2_snapshot_submit(txdesc, txq->idx, host->tid,
					  host->vif_idx, host->staid, host->flags);
	}


	// Set skb jiffies
	skb->jiffies = bk_get_tick();

#if NX_VERSION > NX_VERSION_PACK(6, 22, 0, 0)
	rwnx_tx_postprocess(vif_idx, skb);
#endif

#if 1
	if (skb_queue_len(&txq->sk_list) >= 3 * NX_DEFAULT_TX_CREDIT_CNT) {
		RWNX_LOGV("txq full\n");
		goto exit;
	}
#else
	if (rwnx_txq_is_full(txq)) {
		RWNX_LOGW("txq full\n");
		goto exit;
	}
#endif

#if CONFIG_WIFI_VNET_CONTROLLER
	if(is_ctrl_if_data)
	{
		host->flags |= TXU_CTRL_IF_DATA;
		host->flags |= TXU_CNTRL_PT_RERTY;
		//CIF_STATS_INC(buf_in_txdata);
	}
	else
	{
		host->flags &= ~TXU_CTRL_IF_DATA;
	}
#endif
	TX_STAT_INC(data_tx_xmit2);
	if (PP_HTONS(host->ethertype) == ETH_P_PAE)
	{
		rwnx_eapol_cfm_probe_submit(txdesc);
	}
	// Queue skb
	if (rwnx_txq_queue_skb(skb, txq, 0, NULL))
		rwnx_hwq_process(txq->hwq);

	return 0;

exit:
	// free pbuf
	if (p)
	{
		#if CONFIG_WIFI_VNET_CONTROLLER && !CONFIG_CONTROLLER_AP_BUFFER_COPY
		if((p->flags & PBUF_FLAG_IS_EXTERNAL)||is_ctrl_if_data)
		{
			cif_free_ap_txbuf(p);
		}
		else
		#endif
		{
			pbuf_free(p);
		}
	}
	return ret;
}

/**
 * transmit mgmt frame
 * FIXME: 1. non-CCK; 2. offchannel tx
 */
void rwnx_start_xmit_mgmt(struct sk_buff *skb)
{
	struct hostdesc *host;
	struct txdesc *txdesc;
	struct fhost_tx_desc_tag *fhost_txdesc = NULL;
	bool robust;
	struct rwnx_txq *txq;
	struct ieee80211_mgmt *mac_hdr;
	bool more_pbuf = !!(rwnx_hw_mm_features() & (1ULL << MM_FEAT_MORE_TBD_BIT));
	int p_cnt = 0;

	//BK_LOGD(NULL,"%s: sizeof(fhost_tx_desc_tag)=%d, sizeof(txdesc)=%d\n", __func__,
	//	sizeof(*fhost_txdesc), sizeof(*txdesc));

	// sanity check
	if (skb->vif_idx == INVALID_VIF_IDX)
		goto tx_exit;

	if (more_pbuf)
		p_cnt  = MGMT_FRAME_MAX_TX_PBD_CNT;

	fhost_txdesc = (struct fhost_tx_desc_tag *)os_sram_zalloc(sizeof(struct fhost_tx_desc_tag) + fhost_txdesc_extra_size() + p_cnt * sizeof(struct tx_pbd));

	if (!fhost_txdesc)
		goto tx_exit;
	skb->ftxdesc = fhost_txdesc;

	if (skb->sta_idx != INVALID_STA_IDX) {
		txq = rwnx_txq_sta_get(sta_mgmt_get_entry(skb->sta_idx), NX_STA_MGMT_TXQ_IDX);
	} else {
		if (skb->offchannel) {
#if CONFIG_P2P
			txq = &g_rwnx_hw.txq[NX_OFF_CHAN_TXQ_IDX];
#else
			txq = rwnx_txq_vif_get(mac_vif_mgmt_get_entry(skb->vif_idx),
					       NX_OFF_CHAN_TXQ_IDX);
#endif
		} else {
			txq = rwnx_txq_vif_get(mac_vif_mgmt_get_entry(skb->vif_idx),
					      NX_UNK_TXQ_TYPE);
		}
	}
	if (!txq || txq->idx == TXQ_INACTIVE) {
		RWNX_LOGW("%s txq is invalid\n", __func__);
		goto tx_exit;
	}

#if 0	 //TODO
	if (txq->credits <= 0)
		goto tx_exit;
#endif

	skb->txq = txq;

	// initialize variable
	txdesc = &fhost_txdesc->txdesc;
	host = &txdesc->host;

	mac_hdr = (struct ieee80211_mgmt *)skb->msdu_ptr;
	robust = mfp_is_robust_frame(mac_hdr->frame_control, *((uint8_t *)(mac_hdr + 1)));

	// setup hostdesc
	host->flags = TXU_CNTRL_MGMT;
	if (robust)
		host->flags |= TXU_CNTRL_MGMT_ROBUST;
	if (skb->nocck)
		host->flags |= TXU_CNTRL_MGMT_NO_CCK;
#if NX_VERSION >= NX_VERSION_PACK(6, 22, 0, 0)
	host->hostid = skb;
	host->packet_addr[0] = CPU2HW(skb->msdu_ptr);	//mark not-internal frame
	host->packet_len[0] = skb->len;
#else
	host->buf = skb;
	host->packet_addr = CPU2HW(skb->msdu_ptr);	//mark not-internal frame
	host->packet_len = skb->len;
#endif
	host->tid = 0xFF;
	host->vif_idx = skb->vif_idx;
	host->staid = skb->sta_idx;

	// fill lmac desc
	fhost_txdesc_mgmt_init(txdesc, (uint32_t)skb->msdu_ptr, skb->len);

	// VO for all mgmt frames
	skb->ac = AC_VO;

	// Set skb jiffies
	skb->jiffies = bk_get_tick();

	// Queue skb
	if (rwnx_txq_queue_skb(skb, txq, 0, NULL))
		rwnx_hwq_process(txq->hwq);

	return;

tx_exit:
	if (skb) {
		if (skb->msdu_ptr) {
	        os_free(skb->msdu_ptr);
	        skb->msdu_ptr = NULL;
	    }
		os_free(skb);
	}
	if (fhost_txdesc)
		os_free(fhost_txdesc);
}

void rwnx_start_xmit_raw_ex(struct sk_buff *skb, raw_tx_cntrl_t *raw_tx_cntrl)
{
	struct hostdesc *host;
	struct txdesc *txdesc;
	struct fhost_tx_desc_tag *fhost_txdesc = NULL;
	uint8_t queue_idx = 0;
	uint16_t raw_timeout = 0;
	//bool robust;
	struct rwnx_txq *txq;
	bool more_pbuf = !!(rwnx_hw_mm_features() & (1ULL << MM_FEAT_MORE_TBD_BIT));
	int p_cnt = 0;
	bk_err_t ret = BK_OK;

	queue_idx = raw_tx_cntrl->tx_ac;
	raw_timeout = raw_tx_cntrl->tx_timeout_ms;

	// update tx timeout to 50ms
	ret = txl_cntrl_set_timeout_per_ac(queue_idx, raw_timeout);

	if (ret != BK_OK)
		goto tx_exit;


	//bk_wifi_get_tx_raw_ac(&queue_idx);
	//bk_wifi_get_tx_raw_timeout(&raw_timeout);

	// sanity check
	if (skb->vif_idx == INVALID_VIF_IDX)
		goto tx_exit;

	if (more_pbuf)
		p_cnt = MGMT_FRAME_MAX_TX_PBD_CNT;

	fhost_txdesc = (struct fhost_tx_desc_tag *)os_sram_zalloc(sizeof(struct fhost_tx_desc_tag) + fhost_txdesc_extra_size() + p_cnt * sizeof(struct tx_pbd));

	if (!fhost_txdesc)
		goto tx_exit;

	skb->ftxdesc = fhost_txdesc;

	if (skb->sta_idx != INVALID_STA_IDX) {
		txq = rwnx_txq_sta_get(sta_mgmt_get_entry(skb->sta_idx), NX_STA_MGMT_TXQ_IDX);
	} else {
		if (skb->offchannel) {
#if CONFIG_P2P
			txq = &g_rwnx_hw.txq[NX_OFF_CHAN_TXQ_IDX];
#else
			txq = rwnx_txq_vif_get(mac_vif_mgmt_get_entry(skb->vif_idx),
					       NX_OFF_CHAN_TXQ_IDX);
#endif
		} else {
			txq = rwnx_txq_vif_get(mac_vif_mgmt_get_entry(skb->vif_idx),
					      NX_UNK_TXQ_TYPE);
		}
	}

	if (!txq || txq->idx == TXQ_INACTIVE)
		goto tx_exit;

