JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rwnx_tx.c
#if 0	 //TODO
	if (txq->credits <= 0)
		goto tx_exit;
#endif

	skb->txq = txq;

	// initialize variable
	txdesc = &fhost_txdesc->txdesc;
	host = &txdesc->host;

	fhost_txdesc_raw_ext_init(txdesc, (uint32_t)skb->msdu_ptr, skb->len,
		raw_tx_cntrl->tx_retry_cnt, raw_tx_cntrl->tx_rate, raw_tx_cntrl->tx_power);

	// setup hostdesc
	host->flags = TXU_CNTRL_MGMT;
	if (skb->nocck)
		host->flags |= TXU_CNTRL_MGMT_NO_CCK;
#if NX_VERSION >= NX_VERSION_PACK(6, 22, 0, 0)
	host->hostid = skb;
	host->packet_addr[0] = CPU2HW(skb->msdu_ptr);	//mark not-internal frame
	host->packet_len[0] = skb->len;
#else
	host->buf = skb;
	host->packet_addr = CPU2HW(skb->msdu_ptr);	//mark not-internal frame
	host->packet_len = skb->len;
#endif
	host->tid = 0xFF;
	host->vif_idx = skb->vif_idx;
	host->staid = skb->sta_idx;

    host->flags |= TXU_CNTRL_INDEPENDENT_PT;

	// VO for all mgmt frames
	skb->ac = queue_idx;

	// Set skb jiffies
	skb->jiffies = bk_get_tick();

	// Queue skb
	if (rwnx_txq_queue_skb(skb, txq, 0, NULL))
		rwnx_hwq_process(txq->hwq);

	return;

tx_exit:
	if (skb)
		kfree_skb(skb);
	if (fhost_txdesc)
		os_free(fhost_txdesc);
}
#endif /* CONFIG_RWNX_SW_TXQ */

/*
 * Push the confirmation to the FHOST, refer rwnx_drv: rwnx_txdatacfm
 *
 */
void fhost_tx_cfm_push(uint8_t queue_idx, struct txdesc *txdesc)
{
	struct tx_cfm_tag *cfm = &txdesc->host.cfm;
#if CONFIG_RWNX_SW_TXQ
	struct rwnx_txq *txq;
	struct sk_buff *skb;
#endif

	if (cfm->status & TX_STATUS_DONE) {
		if (PP_HTONS(txdesc->host.ethertype) == ETH_P_PAE)
		{
			struct rwnx_eapol_cfm_probe_s probe;

			bk7258_m2_snapshot_cfm(txdesc, queue_idx, cfm->status);

			if (rwnx_eapol_cfm_probe_take(txdesc, &probe))
			{
				RWNX_LOGW("eapol cfm st=%08x q=%u tid=%u sta=%u "
						  "d31=%lu d33=%lu d34=%lu d35=%lu d36=%lu\n",
						  (unsigned)cfm->status, queue_idx,
						  txdesc->host.tid, txdesc->host.staid,
						  (unsigned long)(bk7258_wifi_isr_count[31] - probe.isr31),
						  (unsigned long)(bk7258_wifi_isr_count[33] - probe.isr33),
						  (unsigned long)(bk7258_wifi_isr_count[34] - probe.isr34),
						  (unsigned long)(bk7258_wifi_isr_count[35] - probe.isr35),
						  (unsigned long)(bk7258_wifi_isr_count[36] - probe.isr36));
			}
		}
#if 1 /* paired final confirmation probe for management and data frames */
		{
			static uint32_t final_cfm_seq;
			uint32_t n = final_cfm_seq++;
			uint8_t *dst = (uint8_t *)&txdesc->host.eth_dest_addr;
			uint8_t *src = (uint8_t *)&txdesc->host.eth_src_addr;
#if NX_UMAC_PRESENT && !NX_FULLY_HOSTED
			unsigned int saddr = (unsigned int)txdesc->host.status_desc_addr;
#else
			unsigned int saddr = 0;
#endif
#if NX_AMSDU_TX || NX_VERSION >= NX_VERSION_PACK(6, 22, 0, 0)
			unsigned int paddr = (unsigned int)txdesc->host.packet_addr[0];
			unsigned int plen = (unsigned int)txdesc->host.packet_len[0];
#else
			unsigned int paddr = (unsigned int)txdesc->host.packet_addr;
			unsigned int plen = (unsigned int)txdesc->host.packet_len;
#endif

			if (n < 48 || (n & 0x3f) == 0)
				RWNX_LOGW("txcfm seq=%u kind=%s q=%u st=%08x ack=%d done=%d "
						  "tid=%u vif=%u sta=%u fl=%08x addr=%08x len=%u "
						  "saddr=%08x eth=%04x dst="MACSTR" src="MACSTR"\n",
						  n,
						  (txdesc->host.flags & TXU_CNTRL_MGMT) ? "mgmt" : "data",
						  queue_idx, (unsigned)cfm->status,
						  !!(cfm->status & TX_STATUS_ACKNOWLEDGED),
						  !!(cfm->status & TX_STATUS_DONE),
						  txdesc->host.tid, txdesc->host.vif_idx,
						  txdesc->host.staid, (unsigned int)txdesc->host.flags,
						  paddr, plen,
						  saddr,
						  txdesc->host.ethertype, MAC2STR(dst), MAC2STR(src));
		}
#endif
		if (txdesc->host.flags & TXU_CNTRL_MGMT) {
#if 0
			/* Confirm transmission to CFG80211 */
			cfg80211_mgmt_tx_status(&sw_txhdr->rwnx_vif->wdev,
									(unsigned long)skb,
									(skb->data + sw_txhdr->headroom),
									sw_txhdr->frame_len,
									rwnx_txst.acknowledged,
									GFP_ATOMIC);
#endif
		}

		//retry xmit: packet has been transmitted but not acknowledged, driver must repush it.
		if (cfm->status & TX_STATUS_RETRY_REQUIRED) {
			/* retransmit the frame: BA bit lost */
#if CONFIG_RWNX_SW_TXQ
#if NX_VERSION >= NX_VERSION_PACK(6, 22, 0, 0)
			skb = (struct sk_buff *)txdesc->host.hostid;
			txdesc->host.flags |= TXU_CNTRL_REUSE_SN;
			txdesc->host.sn_for_retry = (cfm->status & TX_STATUS_SN_MSK) >> TX_STATUS_SN_OFT;
#else
			skb = (struct sk_buff *)txdesc->host.buf;
			txdesc->host.flags |= TXU_CNTRL_RETRY;
#endif
			txdesc->host.flags &= ~TXU_CNTRL_MORE_DATA;

			cfm->status = 0;

			txq = skb->txq;
			if (!txq) {
				goto err_tx;
			}
			/* This txq if flushed before confirmed:
			 * 1. STA sends one packet, waits for txl confirm
			 * 2. STA disconnected from AP, packets are flushed by sw txq
			 * 3. confirm cb called
			 */
			if (txq->idx == TXQ_INACTIVE)
				goto err_tx;

			if ((txdesc->host.flags & TXU_CNTRL_MGMT) && !rwnx_mgmt_retry_tx_check(skb))
				goto err_tx;

			txq->credits++;
			if (txq->credits > 0)
				rwnx_txq_start(txq, RWNX_TXQ_STOP_FULL);

			if (rwnx_txq_queue_skb(skb, txq, 1, NULL))
				rwnx_hwq_process(txq->hwq);
#else /* !CONFIG_RWNX_SW_TXQ */

#if NX_VERSION >= NX_VERSION_PACK(6, 22, 0, 0)
			txdesc->host.flags |= TXU_CNTRL_REUSE_SN;
			txdesc->host.sn_for_retry = (cfm->status & TX_STATUS_SN_MSK) >> TX_STATUS_SN_OFT;
#else
			txdesc->host.flags |= TXU_CNTRL_RETRY;
#endif
			txdesc->host.flags &= ~TXU_CNTRL_MORE_DATA;
			cfm->status = 0;

			if (fhost_txbuf_prepend(txdesc, queue_idx) != kNoErr)
				goto err_tx;
#endif
		} else if (cfm->status & TX_STATUS_SW_RETRY_REQUIRED) {
#if CONFIG_RWNX_SW_TXQ
			// software retry: need to set pn, rebuild frame header, mic, etc.
			cfm->status = 0;

			// uint8_t *eth_payload = HW2CPU(txdesc->host.packet_addr);
			// ETH_HDR_T *eth_hdr = (ETH_HDR_T *)eth_payload - 1;
#if NX_VERSION >= NX_VERSION_PACK(6, 22, 0, 0)
			skb = (struct sk_buff *)txdesc->host.hostid;
#else
			skb = (struct sk_buff *)txdesc->host.buf;
#endif
			txq = skb->txq;
			if (!txq) {
				goto err_tx;
			}
			/* This txq if flushed before confirmed:
			 * 1. STA sends one packet, waits for txl confirm
			 * 2. STA disconnected from AP, packets are flushed by sw txq
			 * 3. confirm cb called
			 */
			if (txq->idx == TXQ_INACTIVE)
				goto err_tx;

			if ((txdesc->host.flags & TXU_CNTRL_MGMT) && !rwnx_mgmt_retry_tx_check(skb))
				goto err_tx;

			//Do NOT re-transmit the packet if retry count has reached the limit
			if (txdesc->host.sw_retry_cnt++ >= CFG_MAX_SW_RETRY_CNT) {
				RWNX_LOGD("SW retry has reached the limit\r\n");
				txdesc->host.sw_retry_cnt = 0;
				goto err_tx;
			}

			txq->credits++;
			if (txq->credits > 0)
				rwnx_txq_start(txq, RWNX_TXQ_STOP_FULL);

			if (rwnx_txq_queue_skb(skb, txq, 1, NULL))
				rwnx_hwq_process(txq->hwq);
#else
			//Do NOT re-transmit the packet if retry count has reached the limit
			if (txdesc->host.sw_retry_cnt++ >= CFG_MAX_SW_RETRY_CNT) {
				RWNX_LOGD("SW retry has reached the limit\r\n");
				txdesc->host.sw_retry_cnt = 0;
				goto err_tx;
			}

			// software retry: need to set pn, rebuild frame header, mic, etc.
			cfm->status = 0;

			if (fhost_txbuf_prepend(txdesc, queue_idx) != kNoErr)
				goto err_tx;
#endif
		} else if (cfm->status & TX_STATUS_ACKNOWLEDGED) {
			//xmit successfully, run callback
			rwnx_tx_confirm(txdesc);
			dbg(D_INF D_FHOST "FHOST: xmit one packet success by queue(%0d)\r\n", queue_idx);
		} else {
err_tx:
			rwnx_tx_confirm(txdesc);
			dbg(D_INF D_FHOST "FHOST: xmit one packet failed by queue(%0d)\r\n", queue_idx);
		}
	} else {
		dbg(D_ERR D_FHOST "FHOST: Rx one error tx_cfm\r\n");
	}
}
